new_app/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Updated Movie Title"], ["description", "\nTony Stark builds an armored suit to fight the throes of evil"], ["updated_at", Mon, 13 Jan 2014 04:52:00 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
    @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @movies = Movie.released
    @movies = Movie.search(params[:search])
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2014-01-13 04:53:16.797919') ORDER BY released_on desc