new_app/app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
          <br>
          <%= link_to pluralize(@movie.reviews.size, "Review"), movie_reviews_path(@movie), class: 'button' %>