flix_test/app/views/movies/index.html.erb

SELECT "movies".* FROM "movies"
SELECT COUNT(*) FROM "movies"
---
<h1><%= pluralize(@movies.size, 'Movie') %></h1>